<template>
  <div class="content">
    <v-layout justify-center>
      <v-img max-width="300" :src="require('/assets/shiranai_sekai.webp')"></v-img>
    </v-layout>
    <section class="section">
      <h2 class="title">
        <a id="chapter0"></a>
        0. はじめに
      </h2>
      <p>
        あなたは、ルービックキューブというおもちゃを知っていますか？
        この本に興味を持ち、読み始めていただいた方の答えはもちろん「はい」だと思います。
        それどころか、私はこれまで老若男女何百人という人とルービックキューブについて会話をしてきましたが、
        ルービックキューブを見たことも聞いたこともない、という人に未だかつて出会ったことがありません。
        ルービックキューブは、それほどまでに有名なおもちゃです。
      </p>
      <p>
        では、あなたはルービックキューブを完成させたことがありますか？一面だけならできる。昔は六面できていた。
        一面もできたこともない。これに対する答えは年代によってもさまざまです。
        しかし、自信を持って完成させられるという人はあまり多くはないと思います。
      </p>
      <p>
        ルービックキューブは、おもちゃであり、パズルです。
        世界で一番有名なパズルでありながら、それを解くことができる人はほんの一握りしかいません。
        ルービックキューブは、それほどまでに難しいパズルです。
      </p>
      <p>
        また、ルービックキューブにはパズルという一面の他に、競技という一面もあります。
        ルービックキューブの早解きのことを「スピードキューブ」と呼び、
        スピードキューブの競技者のことを「キューバー」または「キュービスト」と呼びます。
        野球やサッカーといった体を使ったスポーツや、将棋やチェスのような頭脳スポーツ、
        また最近ブームのe-sportsとはまた違う、アナログで、頭と体をフルに使った新しいスポーツです。
      </p>
      <p>
        本書では、あなたの知らないルービックキューブの世界のほんの一部を紹介します。
        どのように大会が行われているのか。どのような競技があるのか。
        本書を読むことで、この新しいスポーツについて知っていただけると幸いです。
      </p>
      <p>
        本書は「大会編」とあるように、主にルービックキューブに関して行われている競技大会について紹介します。
        ルービックキューブの解き方などについては、競技の紹介の一部として記載することはありますが、
        具体的な内容については触れていませんので、ご了承ください。
      </p>
    </section>
    <section class="section">
      <h2 class="title">
        <a id="chapter1"></a>
        1. 筆者について
      </h2>
      <p>
        私は今から10年以上前、2009年に初めてルービックキューブの大会に出場しました。
        ルービックキューブを揃えられるようになったのはその5年ほど前、大学2年生の頃だったと記憶しています。
      </p>
      <p>
        昔から自宅にルービックキューブがあったのはなんとなく覚えていたのですが、
        子供の頃にそれを揃えようと思ったことはなかったと思います。
        大学2年生のとき、サークルの先輩がルービックキューブを揃えられるということを知り、
        練習をすれば揃えられるものなんだ、ということを初めて知りました。
      </p>
      <p>
        今ほどインターネット上の情報は多くありませんでしたが、揃え方を検索し、六面完成に挑戦しました。
        それが、ルービックキューブとの出会いです。
      </p>
      <p>
        それから5年後、東京に上京したタイミングでルービックキューブの大会があるということを知り出場して以来、
        10年間で50回以上大会に出場しました。その中には、2013年にラスベガスで行われた世界大会や、
        香港、日本（千葉県松戸市）、北京、台湾でそれぞれ行われたアジア大会も含まれます。
        2012年の香港ではルービッククロックという競技で、2014年の日本でのアジア大会では最少手数という競技で、
        それぞれ3位に入賞することができました。
      </p>
      <p>
        また、始めた当初はインターネットで解法を知った私ですが、今は
        <a href="https://roudai.net" target="_blank">roudai.net</a>
        （通称ろーだいねっと）というサイトで解法や手順の解説、掲載を行っています。
      </p>
    </section>
    <section class="section">
      <h2 class="title">
        <a id="chapter2"></a>
        2. ルービックキューブの大会とは
      </h2>
      <p>
        テレビなどで、ルービックキューブの大会が開催されているのを見たことがある人はいるかと思いますが、
        具体的にどのようにして大会が行われているのかを知っている人は少ないのではないでしょうか。
        ここでは、ルービックキューブの大会を誰が、どうやって行っているのかをご紹介します。
      </p>
      <h3 class="title">
        <a id="chapter2-1"></a>
        2-1. 誰が開催しているのか
      </h3>
      <p>
        ルービックキューブの公式大会、および公式記録は、World Cube
        Association、通称WCAが取り仕切っています。
        日本語では、世界キューブ協会と呼びます。WCAは、2004年に発足して活動を開始し、
        2018年10月にはアメリカで非営利団体（NPO）として法人登録されました。
      </p>
      <p>
        各国には、WCAから権限を委譲された団体が存在します。日本でのその組織は、
        一般社団法人スピードキュービングジャパン、通称SCJ(Speedcubing
        Japan)といいます。
        2020年までは、前身となる日本ルービックキューブ協会(JRCA)がその組織でしたが、
        法人化にともない、新たにSCJを立ち上げ運営しています。
        SCJには、公式大会を開催できる人として、 WCA代理人（WCA
        Delegate）が所属しています。この代理人が大会の開催をWCAに宣言し、
        大会の運営を取り仕切り、結果をWCAに報告することで、公式記録として認定されます。
      </p>
      <p>
        また、SCJはWCA公式記録とは認定されない日本独自の大会として、SCJ大会の開催も行っています。
      </p>
      <h3 class="title">
        <a id="chapter2-2"></a>
        2-2. 大会に出るには
      </h3>
      <p>
        大会開催は、WCAやSCJのホームページで告知されます。
        すべての大会はWCAに専用ページが作成され、結果もそのページで公開されますが、
        日本での開催の場合企画はSCJが行っているため、基本的にはSCJからのほうが早く告知されます。
      </p>
      <p>
        大会への申し込みは、インターネット上で行います。SCJの専用ページで申し込むことが多いですが、
        大会によっては独自に専用ホームページや申し込みフォームを作成している場合もあります。
      </p>
      <h3 class="title">
        <a id="chapter2-3"></a>
        2-3. 開催競技
      </h3>
      <p>
        開催される競技は大会により様々ですが、WCAでは現在全部で17の競技が公式競技として認められています。
        その17個とは、
      </p>
      <p>
        <ul>
        <li>3x3x3 キューブ</li>
        <li>2x2x2 キューブ</li>
        <li>4x4x4 キューブ</li>
        <li>5x5x5 キューブ</li>
        <li>6x6x6 キューブ</li>
        <li>7x7x7 キューブ</li>
        <li>3x3x3 目隠し</li>
        <li>3x3x3 最少手数</li>
        <li>3x3x3 片手</li>
        <li>ルービッククロック</li>
        <li>メガミンクス</li>
        <li>ピラミンクス</li>
        <li>スキューブ</li>
        <li>スクエア1</li>
        <li>4x4x4 目隠し</li>
        <li>5x5x5 目隠し</li>
        <li>3x3x3 複数目隠し</li>
      </ul>
      </p>
      <p>
        です（補足 : ルービックキューブを足で揃える「3x3x3
        足」という競技もありましたが、
        2019年12月31日で廃止となりました）。みなさんがよく見る立方体のパズル以外にも、
        色々な種類の立体パズルが公式競技として行われています。各競技については後の章で詳しくご紹介します。
      </p>
      <h3 class="title">
        <a id="chapter2-4"></a>
        2-4. 競技形式
      </h3>
      <p>
        競技の形式には、Average of 5、Mean of 3、Best of
        X（X=1～3）といった形式があります。
      </p>
      <p>
        Average of 5（アベレージオブファイブ）とは、記録の平均値をとる方法です。
        全部で5回タイムの測定を行い、その中から一番早いタイムと一番遅いタイムを除いた3回の平均タイムを記録とします。
        例えば、5回の測定タイムが15秒、12秒、17秒、13秒、14秒だった場合、
        一番早いタイムである12秒と一番遅いタイムである17秒は記録から除き、13秒、14秒、15秒の3回の平均値、
        つまり(13 + 14 + 15) ÷ 3 =
        14秒が公式記録となります（実際のタイムは小数点第2位までを記録します）。
        5回のうち1回は失敗してもいいし、1回はすごく調子が良くても記録からは除かれてしまうということですね
        （一番早いタイムは、単発記録として記録され、これも平均タイムとは別にランキング付けされます）。
        Average of
        5はルービックキューブの大会での最も基本的な測定方法で、通常の3x3x3キューブや
        メガミンクス等の他種類のパズルでもこの形式が採用されています。
        最終的な順位についても、この平均タイムが早い順に順位を決めます。
      </p>
      <p>
        Mean of
        3（ミーンオブスリー）とは、記録の平均値をとるという意味ではAverage of
        5と同様ですが、 3回のみ記録を測定し、その3回すべての平均値を記録します。
        6x6x6、7x7x7、最少手数といった、1回の競技に時間のかかる競技で採用されています。
      </p>
      <p>
        Best of
        X（X=1～3）は、X回測定を行い、その中から一番早いタイムを記録とします。Best
        of 3（ベストオブスリー）の場合は、3回測定を行います。
        目隠し系の、そもそも成功させること自体が難しい競技で採用されています。
      </p>
      <h3 class="title">
        <a id="chapter2-5"></a>
        2-5. 大会についてのQ&A
      </h3>
      <p>ここからは、Q&A形式で大会について紹介していきます。</p>
      <h4>
        <a href=""></a>
        Q1. ルービックキューブの崩れ方によって、有利不利があるんじゃないの？
      </h4>
      <p>
        ルービックキューブは、ジャグリングやけん玉と違い、スタート時点の状態が毎回違います。
        それが面白いところでもあるのですが、その初期状態によって難易度の違いがでてしまうのではないか、
        というのは当然の疑問です。優勝を決めるような場面で、あっちの選手のほうが簡単だった！
        なんていうことになると、より一層運要素が強くなってしまいます。
      </p>
      <p>
        このような問題を解決するために、大会では同時に競技を行う人達については、
        全員同じ初期状態から競技を始めることになっています。
        ただ適当にバラバラにしてタイム測定を行っているわけではないということです。
      </p>
      <p>
        ルービックキューブをバラバラな状態にすることを「スクランブル」と呼びます。
        そして大会では、競技を行う人達が同じ状態で競技を始められるように、
        ルービックキューブを同じスクランブル状態にする「スクランブラ」と呼ばれるスタッフがいます
        （実際にはほとんどの場合競技者が自分が出場していないときに持ち回りで役割分担をします）。
        スクランブラはルービックキューブの回転記号で記載されたスクランブル手順を元に、
        すべてのパズルを全く同じ状態に崩します。
        このスクランブル手順は、公式で決められたプログラムを用いて出力されます。
      </p>
      <h4>Q2. どうやってタイムを測定するの？</h4>
      <p>
        スピードスタックスというスポーツをご存知でしょうか？
        一度くらいはテレビやYoutubeで見たことがあるのではないでしょうか。
        プラスチックのコップのようなものを、ものすごいスピードで重ねたり積み上げたりしてタイムを争う競技です。
      </p>
      <p>
        ルービックキューブでのタイム測定では、このスピードスタックスで使用するタイマー
        （スタックタイマー）を競技用として用いています。
      </p>
      <p>
        両手をタイマーにつけてスタンバイし、タイマーから手を離した瞬間から再び
        タイマーに両手を乗せるまでの時間を測定します。
        開始時にはキューブを触らず、揃い終わったあとキューブから手を放して手を置くまでの時間を測ることができるので、
        とても都合がいいですね。
      </p>
      <h4>Q3. 競技で使うルービックキューブは運営側が用意してくれるの？</h4>
      <p>
        競技で使うパズルは、選手が自分で用意する必要があります。運営側からの貸出といったことはしていません。
      </p>
      <p>
        これは、自分が使用するパズルのメンテナンスも含めて、競技の一部だと考えることができます。
        トップ選手になると回転の軽さなど回し心地がタイムに大きく影響するため、
        日々の練習とともにこういったメンテナンスにも多くの時間を費やします。
      </p>
      <h4>Q4. 競技用のルービックキューブって何が違うの？</h4>
      <p>
        ルービックキューブは日本でも普通におもちゃ屋で売っていますが、
        競技者達はそういったどこででも買えるルービックキューブは使っておらず、
        競技用に製造されているルービックキューブを使用しています。いったい何が違うのでしょうか。
      </p>
      <p>
        普通のルービックキューブと競技用のルービックキューブをそれぞれ触ってみてまず分かるのは、回転の軽さです。
        競技用のほうが回しやすく、軽い力で回すことができます。
        また、その回転の軽さが簡単に調整できるように、バネの強さや締め付け具合が調整ができるようになっています。
      </p>
      <p>
        次に、コーナーカットと言われるものがあります。
        普通のルービックキューブでは各面を90度ずつキッチリと回さないと次の回転をすることができませんが、
        競技用ではコーナーのキューブカットに工夫がされており、
        30度～40度程度回転しきっていない状態からでも次の回転をすることができます。
        これにより、より速く、連続してキューブを回転させることが可能になります。
      </p>
      <p>
        また、現在の競技用のルービックキューブの多くは磁石が仕込まれています。
        この磁石によって回転中の動きが補助され、回しすぎの防止や動きが安定といった効果があります。
      </p>
      <h4>Q5. ルービックキューブはいきなり解き始めるの？</h4>
      <p>
        公式大会でタイム測定を行う場合、タイムを測る前に「インスペクションタイム」と呼ばれる
        キューブを手にとって解くための作戦を立てる時間が最大15秒与えられます（目隠し競技は除く）。
        15秒以内であればいつ始めても良いですが、15秒を越えると2秒のペナルティーが、
        17秒を越えると試技の失格となります。
      </p>
      <p>
        この15秒で六面完成までの道筋すべてを読み解くことはできませんが
        （よく最後まで読み切っているのかと勘違いされます）、
        最初の1ステップ、5～10回程度回す手順までは読むことができます。
      </p>
      <p>
        ですので、競技者にスピードキューブを見せてもらう時には、
        ぐちゃぐちゃにしたあとに渡してハイ解いて！ではなく、
        10秒くらいでいいので考える時間をあげてください。
      </p>
      <h4>Q6. 年齢制限や、年齢別の大会はあるの？</h4>
      <p>
        大会出場に年齢制限は一切ありません。3歳から80代まで、本当に色々な年代の人達がいます。
        もっとも多いのは、高校生～大学生の年代でしょうか。
        最近はサークル活動としてスピードキューブをしている大学生も多いので、大学生はやはり多くなります。
        世界的なトレンドを見ると、トップレベルの選手は中学生～高校生が多いように思います。
      </p>
      <p>
        また、年齢別の大会や表彰といったものは基本的にはありません。
        実は、WCAの大会規約により年齢によって大会出場を制限することは禁止されています。
        ただし、SCJ独自に小学生の順位だけで表彰を行ったり、
        20代、30代等年代別に表彰を行ったりすることは稀にあります。
        この場合も、WCAの記録としてはこういった表彰の履歴は残りません。
      </p>
      <h4>Q7. アジア大会や世界大会に出るには予選があるの？</h4>
      <p>
        2022年現在、世界大会であっても、それに出場するための予選というのはありません。
        基本的には、交通費、滞在費、大会参加費を払えば、誰でも出場することができます。
        ただし、大会により種目ごとに参加基準タイムというものがあり、
        それよりも良い記録を持っていないと出場できないといったことはあります。
        メイン競技である3x3x3キューブでは門戸を開くため基準タイムがかなり緩く設定されていることが多いですが、
        それ以外の種目では世界大会ともなるとそれなりの記録が求められます。
      </p>
      <h4>
        Q8. 大会で優勝すると賞金はもらえるの？賞金で生活している人はいる？
      </h4>
      <p>
        小さな大会ではあまり賞金がでることはありませんが、
        日本大会以上の大きな大会であれば賞金や副賞がでることがあります。
        しかし、世界大会で優勝しても10～20万円ほどで、
        旅費の足しになる程度で賞金を稼ぐだけで生活をするというような人はいまのところいません。
      </p>
      <p>
        しかし最近は競技用キューブを作る中国のメーカーや、
        各国の競技用キューブ販売会社が積極的に世界トップ選手達のスポンサーをしています。
        これにより、報酬をもらって大会時にロゴを身につけたり、
        またメーカーであればそのブランドのパズルを使って世界記録を出したときに特別報酬を出すなどしています。
        世界トップレベルの選手の中には、このようなスポンサー報酬により
        ある程度生計を立てている人は既に何名かいるかもしれません。
      </p>
      <h4>Q9. 世界記録はどれくらいなの？</h4>
      <p>
        ルービックキューブはまだまだ発展途上な競技なため、世界記録は次々に更新されます。
        年に何回も更新されるのが当たり前で、1日の間に別々の場所で2回記録が更新されてしまった、
        なんていうこともあるほどです。 最新の世界記録は、記録を管理している
        WCAのホームページから閲覧することが可能です（<a
          href="https://www.worldcubeassociation.org/results/records"
          target="_blank"
          >世界記録一覧</a
        >）。
        参考までに、2022年11月現在の3x3x3キューブ平均と世界記録は、Tymon
        Kolasiński、Max Parkの二人が
        もっている、4.86秒です。そしてこの記録は共に、2022年に更新されたものです。
      </p>
      <h3 class="title">
        <a id="short1"></a>
        小話1 ルービックキューブはどれだけ難しいのか
      </h3>
      <p>
        ルービックキューブというたった3x3x3＝27個のブロックからできたパスルに、
        どれだけの組み合わせパターンがあるか知っていますか？
        答えは、43,252,003,274,489,856,000通りです。日本語にすると、4325京2003兆2744億8985万6000通り。
        どんな数字なのか、ちょっと想像がつきませんね。
      </p>
      <p>
        ルービックキューブがハンガリーで発売されたのが1977年、日本での発売が1980年ですので、
        ざっくり40年経ったとします。1年を365日とすると、14600日が経過したことになります。
        世界の人口を70億人として、70億人全員が14600日間毎日100回ルービックキューブをバラバラにすると、
        ルービックキューブは1京220兆回バラバラにされることになります。
        ルービックキューブの組み合わせが4325京ですので、まだ1000分の1にも達していません。
        人類がすべての組み合わせに遭遇するためには、40年×4000＝16万年の時間が必要です。
      </p>
      <p>
        別の視点から見てみましょう。ルービックキューブを適当に回していたらそのうち揃わないかな？
        と思ったことはないでしょうか。ルービックキューブを1秒に1回転したとして、
        1時間で3,600回、一日で86,400回、1年で3153万6000回回すことができます。
        このペースでルービックキューブの全組み合わせを引き当てるには、1兆3700億年が必要です。
        宇宙ができてから138億年と言われていますので、100回分宇宙の誕生から今までの時間が必要になります。
      </p>
      <p>
        こういった数字を見ると絶望的にも感じますが、実際にはわずかな手順を組み合わせるだけで解くことができ、
        先人達の知恵は素晴らしいものがあります。そういったバランスの良さも、
        長年パズルとして楽しまれている要因かと思います。
      </p>
    </section>
    <section class="section">
      <h2 class="title">
        <a id="chapter3"></a>
        3. 各競技の紹介
      </h2>
      <p>
        ここからは、公式競技として決められている17種目についてそれぞれ紹介します。
        （補足：2019年をもって「3x3x3
        足」は公式競技から除外されましたが、ここでは参考としてご紹介します。）
      </p>
      <h3 class="title">
        <a id="chapter3-1"></a>
        3-1. 3x3x3キューブ
      </h3>
      <p>
        もっともポピュラーな、通常のルービックキューブの早解きを競う競技です。
        Average of 5形式により順位を決めます。
        普通のルービックキューブなので競技名もルービックキューブと呼べばいいのですが、
        権利の関係等あり3x3x3キューブと呼ぶことが多いです。
      </p>
      <p>
        大会の中でも一番のメインイベントになることがほとんどです。
        陸上競技でいうと、100m走といったところでしょうか。
        世界大会などでも、数日間大会を行った最終日の一番最後に決勝を行います。
      </p>
      <p>
        現在ルービックキューブを早く解くのに最もよく使われている解法は、CFOPメソッドと呼ばれている方法です。
        これは、キューブを解く過程をCross、F2L、OLL、PLLという4段階に分ける方法で、
        それぞれの頭文字をとってCFOPと呼ばれます。
        競技者の99%はこの解法、及びそのさらに発展形の方法を用いていると言ってよいでしょう。
        その他のスピード向け解法としてはRoux（ルー）メソッド、ZZメソッドといったものがあります。
      </p>
      <p>
        2003年から隔年で行われている世界大会の優勝者、優勝記録（Average of
        5の記録）は、下記の通りです
        （2021年は新型コロナウィルス対策のため未開催）。
      </p>
      <ul>
        <li>2003年 Dan Knights (USA) 20.00秒</li>
        <li>2005年 Jean Pons (France) 15.10秒</li>
        <li>2007年 中島悠 (日本) 12.46秒</li>
        <li>2009年 Breandan Vallance (United Kingdom) 10.74秒</li>
        <li>2011年 Michał Pleskowicz (Poland) 8.65秒</li>
        <li>2013年 Feliks Zemdegs (Australia) 8.18秒</li>
        <li>2015年 Feliks Zemdegs (Australia) 7.56秒</li>
        <li>2017年 Max Park (USA) 6.85秒</li>
        <li>2019年 Philipp Weyer (Germany) 6.74秒</li>
      </ul>
      <p>
        第1回大会から16年間、計9回大会を行ってもいまだに記録が上がり続けているところを見ても、
        発展途上な競技であることが分かります。
      </p>
      <p>
        また見ての通り、2007年には日本人の中島悠さんが優勝しています。
        当時は高校生で、ルービックキューブを始めてわずか1年で世界チャンピオンになったことで、話題になりました。
        現在は、立体パズルのインターネット通販専門店であるトライボックス株式会社の代表取締役として勤め、
        テレビの出演や取材を通してルービックキューブ、スピードキューブの普及活動をされています。
      </p>
      <h3 class="title">
        <a id="chapter3-2"></a>
        3-2. 2x2x2キューブ
      </h3>
      <p>
        通常のルービックキューブよりも一段階小さい、2x2x2のキューブの早解きを競う競技です。
        Average of 5形式により順位を決めます。
      </p>
      <p>
        ルービックキューブより一回り小さく、ブロックも27個から8個に減るため、
        一見誰でも解くことができそうですが、それでも3,674,160通りのパターンがあります。
        ルービックキューブの4325京よりはだいぶ可愛い数字になりましたが、
        それでも適当に回していて揃うような数ではなさそうです。
        また、2層しかないため、どこか1箇所を動かすと全体のうちの半分が動いてしまうというのも、
        解いていて混乱してしまう要因です。見た目と実際の難易度の差が激しく、
        私はこの2x2x2キューブを、「世界で一番、簡単に解けそうに見えて簡単には解けないパズル」と呼んでいます。
      </p>
      <p>
        ですが、競技としての解法は完全に成熟しきっており、
        トップ選手達は15秒のインスペクションタイムの間に完成までの手順を完全に読み切ってしまいます。
        2022年現在の単発世界記録は0.49秒です。
        ルール上、3手以下で揃うパターンはスクランブル状態として出現しないよう調整されていますが、
        やはり単発の世界記録は4手で揃うパターンでしかもはや出ないため、ほとんど運だけのような世界です
        （それでも4手を0.49秒で回すのは凄いですが）。
      </p>
      <h3 class="title">
        <a id="chapter3-3"></a>
        3-3. 4x4x4キューブ
      </h3>
      <p>
        通常のルービックキューブよりも一段階大きい、4x4x4のキューブの早解きを競う競技です。Average
        of 5形式により順位を決めます。
      </p>
      <p>
        パターン数は7.4×10の46乗（ルービックキューブは4.6×10の19乗）となり、さらに天文学的数字となります。
        しかし、実際にはこの数字に表れるほどルービックキューブと難易度が違うわけではなく、
        ルービックキューブが解ける人であればプラスでいくつかの手順を覚えてしまえば案外難なく解くことができます。
        この辺りも、ルービックキューブの面白いところです。
      </p>
      <p>
        特徴のひとつとして、3x3x3や5x5x5のように、
        辺のブロックの数が奇数であれば面の中心にパーツがあるため各面の色が固定されますが、
        偶数の場合にはセンターが存在しないため、面の色が固定されません。
        もちろん、完成状態と違う配置の面の色で揃うことはないため、解く際には常に各面の色を意識する必要があります。
      </p>
      <p>
        また、偶数パズルを語る際に欠かせないのが、「パリティ」の存在です。
        パリティについて簡単に説明するのは非常に難しいのですが、ひとことでいうと、
        3x3x3のキューブでは存在し得ないパターンが出現することがあります。
        4x4x4以上のキューブを解く場合、まずセンターの色、
        そしてエッジ（ルービックキューブでいうコーナーとコーナーの間の2面しかない場所）
        の色を揃えて3x3x3と同様の状態にしてから解く方法が一般的なのですが（この方法を「リダクション」と呼びます）、
        3x3x3の状態にしたにも関わらず、そこから解こうとすると、3x3x3では出現せず、
        4x4x4では出現するパターンが存在します。そしてこれが出現する確率は、完全に五分五分です。
        将来的にはこのパリティを回避することができる解法が出現する可能性はゼロではありませんが、
        今のところこれをスピードキューブの早さで解きながら意図的に回避することは不可能です。
        このパリティがあるかないかでトップ選手でも1～2秒ほどのロスをしてしまうため、
        どうしても運要素が絡んでしまう競技と言われます。
      </p>
      <h3 class="title">
        <a id="chapter3-4"></a>
        3-4. 5x5x5キューブ
      </h3>
      <p>
        4x4x4キューブよりもさらに一段階大きい、5x5x5のキューブの早解きを競う競技です。
        Average of 5形式により順位を決めます。 6x6x6以上はMean of
        3となるため、Average of 5の競技の中では最大のキューブです。
      </p>
      <p>
        サイズの大きなキューブでありながら、世界トップレベルの選手であれば40～50秒程度で揃えてしまうため、
        スピード感とのバランスがとても良く見ていて楽しい競技だと思います。
        4x4x4キューブと違い辺のブロックの数が奇数のためパリティがないところも、
        実力勝負ができる気がして楽しいところでもあります。
      </p>
      <h3 class="title">
        <a id="chapter3-5"></a>
        3-5. 6x6x6キューブ
      </h3>
      <p>
        5x5x5キューブよりもさらに一段階大きい、6x6x6のキューブの早解きを競う競技です。
        5x5x5までとは違い、Mean of 3形式により順位を決めます。
        揃えるまでに比較的時間のかかる競技なため（それでも世界トップレベルは1分ちょっとで揃えてしまうのですが）、
        Mean of
        3での競技となります。1度も失敗できないため、そういった面では厳しい競技でもあります。
      </p>
      <p>
        4x4x4キューブと同様偶数系のパズルのため、6x6x6にも4x4x4と同じパリティが発生します。
        4x4x4よりも揃えるのに時間がかかるためパリティによる運要素はまだ小さいと言えますが、
        それでもやはりパリティの存在は常に競技者を悩ませます。
      </p>
      <p>
        また、6x6x6はセンターのない超多分割キューブということで構造的にかなり難があるようで、
        2008年頃、ギリシャの会社(V-CUBE)が初めて6x6x6を発売し、個人輸入で購入したときには、
        1回回そうとしただけでパーツが外れて壊れてしまったことを今でも覚えています。
        現在はかなり改善され、競技用として高速での回転にも耐えられるものが発売されています。
      </p>
      <h3 class="title">
        <a id="chapter3-6"></a>
        3-6. 7x7x7キューブ
      </h3>
      <p>
        6x6x6キューブよりもさらに一段階多い、7x7x7のキューブの早解きを競う競技です。
        6x6x6と同様、Mean of 3形式により順位を決めます。
        立方体パズルの公式競技としては、最大のサイズになります。こちらも5x5x5と同様、パリティはありません。
      </p>
      <p>
        7x7x7キューブは構造上6x6x6までと違うところが一点あります。
        それは分割数が7x7x7を超えると、すべての分割の大きさが同じ場合、
        一面を45度回したときに角のパーツがはみ出してしまい、保持できなくなってしまうことです。
        この問題を解決する方法は2つあり、一つはキューブを立方体ではなく微妙に丸みを帯びた形にすること、
        そしてもう一つは最外層の分割幅を内層よりも大きくすることです。
        7x7x7が発売された当時は前者の丸みを帯びた形（ピローキューブと呼びます）のものが主流でしたが、
        現在では後者のものがほとんどです。
      </p>
      <h3 class="title">
        <a id="short2"></a>
        小話2 スクランブルプログラムについて
      </h3>
      <p>
        大会では公式で決められたプログラムを用いて出力したスクランブルを用いて競技を行うということを述べましたが、
        そのプログラムは一般に公開されており、誰でも使うことができます。
      </p>
      <p>
        <a href="https://www.worldcubeassociation.org/regulations/scrambles/" target="_blank">WCA Scrambles</a>
      </p>
      <p>
        このプログラムから出力した実際のPDFが、下記のものになります。
      </p>
      <p>
        <a href="/TNoodleScramble.pdf" target="_blank">スクランブル用紙</a>
      </p>
      <p>
        大会では、このPDFを印刷したものを用いてスクランブラが実際にスクランブルをしていきます。
        スクランブルの出力は、セキュリティ上の理由からオンラインではなくパソコンにプログラムをダウンロードしてから実行する必要があります。
      </p>
      <p>
        スクランブルは、各パズル専用に決められた回転記号を元に表します。
        完全にランダムな状態を作るために、全ての状態からランダムに選ばれた状態（各状態は等確率）をプログラムで作り、
        その状態にするための手順を算出してスクランブル手順とします。
        ただし、5x5x5キューブ、6x6x6キューブ、7x7x7キューブ、メガミンクスは、ランダムな状態からの手順の算出に時間がかかりすぎてしまうため、
        十分に多くの回転（6x6x6なら80、7x7x7なら100など）をすることで十分にスクランブルされたものとみなしています。
      </p>
      <h3 class="title">
        <a id="chapter3-7"></a>
        3-7. 3x3x3 目隠し
      </h3>
      <p>
        3x3x3キューブを、目隠しをして揃えます。キューブを揃えている時間だけではなく、
        暗記する時間も合わせてタイムを測定します。
        つまり、キューブを見て暗記し、目隠しをして揃え終わるまでの時間を競います。
        熟練者でも100%成功するようなものではないため、Best of
        X（X=1～3）形式により順位を決めます。 通常はBest of
        3で行われます。そのため、3回試技を行い1回でも成功させれば良いことになります。
        また大会での順位には影響しませんが、Mean of
        3の結果も公式記録として記録され、 ランキングとして認められています。
      </p>
      <p>
        目隠し（英語ではBlindfolded）と呼ばれるだけあって、解くときには目隠しをする必要がありますが、
        公式大会ルールでは目隠しに加えて顔とキューブの間に「不透明な板状のもの」を挟むことが必須とされています。
        実際には競技者の横でジャッジ役をする人が、
        目隠しをして回し始めた段階で顔とキューブの間に何かしらの紙を差し込みます。
        このルールには経緯があり、2008年頃、当時世界記録を持っていた選手が、
        実は目隠しの間から覗き見ていたことが発覚したことがきっかけです。
        この件は競技者達の間に大きな衝撃を与え、それ以来目隠しだけでは不十分ということで、
        不正を防ぐために視界を遮ることがルールとして制定されました。
        しかしそれでも目隠し競技で覗き見ようとする不正は年に数回は世界中で発生しているようです。
      </p>
      <p>
        ルービックキューブを目隠しで揃える方法は、通常の早解きのときの方法とは全く異なります。
        全く知らない人からすると超人技かのように見える競技ですが、解法自体は確立されており、
        暗記の方法と解き方をしっかりと学べば、十分習得できるものです。
      </p>
      <h3 class="title">
        <a id="chapter3-8"></a>
        3-8. 3x3x3 最少手数
      </h3>
      <p>
        制限時間1時間以内に、ルービックキューブをいかに「少ない手数」で揃えることができるかを競う競技です。
        「最も少ない」という意味で、「最小」ではなく「最少」と表記します。
        英語では「Fewest Move
        Challenge」と言い、略称として「FMC」とよく呼ばれます。
        他の競技がタイムを競うのに対して、かなり特殊な競技です。
        競技形式は大会により異なり、最近はMean of 3によるものが増えていますが、
        比較的小規模な大会であればBest of 1やBest of 2で行う場合もあります。
        Mean of 3の場合、競技時間だけで3時間もかかる長丁場になります。
      </p>
      <p>
        競技者が用意するものは、ルービックキューブを3つまでと、
        必要であればキューブに目印として貼るためのステッカーです（飲み物や時計の持ち込みは適宜認められています）。
      </p>
      <p>
        まず、キューブを崩すための「崩し手順」（スクランブル）が書かれた問題用紙兼解答用紙と、メモ用紙、ボールペンが配られます。
      </p>
      <p>
        競技が始まると、崩し手順を用いてルービックキューブを崩し、
        それをどれだけ短い手数で揃えられるか解法を考えます。
        制限時間内であれば、何度も揃えては崩しを繰り返し、試行錯誤することができます。
      </p>
      <p>
        崩す方法が分かっているのなら、それと逆に回せば一番短くなるのではないか？
        という疑問がありますが、もちろんこれは認められません。
        「崩し手順とは異なる方法で」「論理的に説明できる方法で」完成させないといけません。
        目安として、解法の最初の4手以上が崩し手順の逆と一致している場合には、無効な記録とされます。
      </p>
      <p>
        そして、自分が考えた解法を回転記号を用いて書き、提出します。それを大会運営者が採点し、手数が短いほど良い記録となります。
      </p>
      <p>
        Mean of
        3で競技を行う場合1つでも書き間違えや時間不足で記録なしとなった場合平均記録が残らないため、過酷な競技です。
      </p>
      <h3 class="title">
        <a id="chapter3-9"></a>
        3-9. 3x3x3 片手
      </h3>
      <p>
        3x3x3キューブを、片手のみを使って揃えます。それ以外のルールは通常の3x3x3早解きと変わらず、
        Average of 5形式により順位を決めます。
        また片手のみと言いつつも、机を使ってキューブの一部を固定した状態で回したり、
        キューブを机に置いた状態で回すことは許可されています。
        ただし、手以外の体の一部（腕や胸など）を使うことは許可されていません。
      </p>
      <p>
        右手と左手のどちらを使っても構いません。試技によって違う手を使ってももちろん問題ありませんが、
        普通は同じ手を使って揃えます。また、右利きの人の場合、左手を使って揃える場合がほとんどです。
        左手を使って揃えるのを見せると、左利きなのか？ということをよく聞かれます。
        これには事情があって、通常両手でルービックキューブを解く場合、
        もちろん利き手で回したほうが回しやすいので、可能な限りキューブの右側の面を多く回す手順を使うことになります。
        これと同じ手順を片手で回そうとしたとき、左手で持って、薬指または小指を使って回した方が回しやすいのです。
        右手で持った場合、親指と中指か薬指で保持した状態で人差し指で回す必要があるため、とても回しにくくなります。
        一度キューブを手に持ってやってみるとよく分かるかと思います。
      </p>
      <h3 class="title">
        <a id="chapter3-10"></a>
        3-10. 3x3x3 足
      </h3>
      <p>
        3x3x3キューブを、足のみを使って揃えます。それ以外のルールは通常の3x3x3早解きと変わりません。
        2017年まではMean of 3で競技を行っていましたが、2018年よりAverage of
        5に変更されました。
      </p>
      <p>
        足を使ってキューブを持ち上げた状態で回すのは無理ですので、キューブを床に置いた状態で回すことになります。
      </p>
      <p>
        タイマーも足を使ってスタート、ストップさせます。
        また、椅子に座って解くか、床に座って解くかは決まりはなく、競技者が自由に選ぶことができます。
        床に座ったほうが大会会場の椅子のコンディションに左右されないためそちらを好む人も中にはいますが、
        それを差し引いても回しやすさの観点からか、現在は椅子に座って競技をする人がほとんどです。
      </p>
      <p>
        この競技は、2019年いっぱいで公式競技から除外されました。
        ただし、例えば両手が不自由であるといった理由があれば、
        通常の3x3x3キューブを足で解くことはもちろん許されます。
      </p>
      <h3 class="title">
        <a id="short3"></a>
        小話3 大会での不正について
      </h3>
      <p>
        目隠し競技の紹介の中で、目隠しの間からキューブを覗きこむ不正について紹介をしました。
        大会ではこういった競技中の不正行為は頻繁に起こっており、
        特に重大な問題についてはWCAのホームページの中で内容報告が行われることがあります。
      </p>
      <p>
        例えば、最少手数競技では、競技中にスマートフォンを使って手順をカンニングするという不正が起こったことがあります。
        多数の手順を知っていることが短い手数を導くこともある最少手数競技では、最も許してはいけない不正のひとつです。
        この不正への対策のため、競技開始前の電子機器の電源オフや、
        スマートウォッチを用いていないことの確認は最近特に厳しく行っています。
        国によっては、競技中スマートフォンを運営に渡すことを義務付けているところもあります。
      </p>
      <p>
        その他の不正としては、運営と競技者が手を組んでいた、といった類のものもあります。
        例えばスクランブラが本来のスクランブル手順を無視し、
        競技をしている友人のためにわざと簡単に崩されたものを用意していたなんていう不正も存在します。
      </p>
      <p>
        こういった不正はWCA内で組織されている懲罰委員会の中で議論され、
        その重大さを加味して一定期間の出場停止等の懲罰が与えられます。
        例えば、目隠しで覗き見をした場合には、一年間の大会出場停止などの処分が下されます。
      </p>
      <h3 class="title">
        <a id="chapter3-11"></a>
        3-11. ルービッククロック
      </h3>
      <p>
        ここからいくつかは、通常のルービックキューブとは異なるパズルの競技になります。
        まずは、ルービッククロックです。ルービッククロックは、公式競技として認められているパズルの中でも、
        最も特異なパズルと言って良いかと思います。
        なぜなら、これだけは「立体パズル」とは言い難いものだからです。
        ルービッククロックの見た目については下記ページを参考にしてください。<br />
        <a
          href="https://store.tribox.com/products/detail.php?product_id=3047"
          target="_blank"
          >https://store.tribox.com/products/detail.php?product_id=3047</a
        >
      </p>
      <p>
        ルービッククロックは4つのボタンと、4つのダイヤルを駆使して、裏表9つずつある針を、
        すべて同じ方向（時計で言う12時の方向）に揃えれば完成となるパズルです。
        見ての通り、見た目もパズルの内容も、ルービックキューブとは全く異なります。
      </p>
      <p>
        表裏両方を同時に揃える必要があり、一見するととても難しいパズルに見えますが、
        おそらくパズルとしては、公式競技で認められているものの中で最も簡単なものです。
        ルービックキューブを解き方を学ばず自力で解くのはかなり難しいかと思いますが、
        ルービッククロックは十分自力で解くことが可能なパズルだと思います。
      </p>
      <p>
        他のパズル同様、Average of 5形式で競技を行います。
        ルービッククロックは大会で行うには一つ大きな難点のある競技で、
        それは観客から見るとパズルを解いている過程が全く分からず、
        またパズルが完成したのかどうかも遠くからではよく分からないことです。
        パズルの完成を確認するには表裏を確認する必要があり、その確認はジャッジが行います。
      </p>
      <p>
        また、パズルの要素のひとつである「ピン」の状態もスクランブルとして含まれ、
        このピンは横倒しにすると動いてしまい状態が変わってしまうため、
        ジャッジや競技者は競技開始前にパズルを倒してしまわないよう細心の注意を払う必要があります。
      </p>
      <h3 class="title">
        <a id="chapter3-12"></a>
        3-12. メガミンクス
      </h3>
      <p>
        メガミンクスは、各面が五角形の正十二面体のパズルです。メガミンクスの見た目については下記ページを参考にして下さい。<br />
        <a
          href="https://store.tribox.com/products/detail.php?product_id=2935"
          target="_blank"
        >
          https://store.tribox.com/products/detail.php?product_id=2935
        </a>
      </p>
      <p>
        他のパズル同様Average of 5形式により順位を決めます。
        一見するとどのように動くのか想像がつきにくいですが、各面の表面だけが回転することができます。
      </p>
      <p>
        公式競技の中で最も面数の多いパズルなので、とても難しいように見えますが、
        実際にはかなりの部分が3x3x3キューブの応用で解くことができます。
      </p>
      <p>
        また公式競技としてはありませんが、メガミンクスの派生パズルとして、
        各面が2層になったギガミンクス、3層になったテラミンクス、4層になったペタミンクスといったものも存在します。
      </p>
      <h3 class="title">
        <a id="chapter3-13"></a>
        3-13. ピラミンクス
      </h3>
      <p>
        ピラミンクスは、各面が三角形の正四面体のパズルです。
        ピラミンクスの見た目については下記ページを参考にして下さい。
        ピラミッドみたいな名前ですが、ピラミッドは底面が四角形なのでピラミッド型ではありません。<br />
        <a href="https://store.tribox.com/products/detail.php?product_id=3272"  target="_blank">
          https://store.tribox.com/products/detail.php?product_id=3272
        </a>
      </p>
      <p>
        他のパズルと同様Average of 5形式により順位を決めます。
        三角形の四面体ということで、立体として成り立つ最小の形なので、見た目はとてもシンプルです。
        パズルとしての難易度も、ルービックキューブと比べるとだいぶ低くなります。
      </p>
      <p>
        しかしながら、2x2x2キューブとは異なり、スクランブル状態から完成までの手順を完璧に読むというのは、
        世界トップレベルの選手でもなかなか困難なようです。
        また、他のパズルと比べて解法のバリエーションが多く、
        トップ選手はスクランブル状態によってさまざまな解き方を使い分けており、なかなか奥の深い競技です。
      </p>
      <h3 class="title">
        <a id="chapter3-14"></a>
        3-14. スキューブ
      </h3>
      <p>
        スキューブは、形は立方体ですが、斜めにカットされた方向に回転するという変わったパズルです。他のパズルと同様Average
        of 5形式で順位を決めます。
        スキューブの見た目については下記ページを参考にして下さい。<br />
        <a href="https://store.tribox.com/products/detail.php?product_id=3360"  target="_blank">
          https://store.tribox.com/products/detail.php?product_id=3360
        </a>
      </p>
      <p>
        ほとんどの公式競技はWCA発足当初～2,
        3年程度の間に公式競技化されていますが、
        スキューブは2013年に公式競技になった競技です。
      </p>
      <p>
        他のパズルと異なる大きな特徴は、斜めに回転することです。
        そのため、高速で回すのがより困難になります。パズルとしての難易度はそこまで高くはなく、
        また2x2x2キューブ同様数秒で終わる競技のため、特に単発記録では運の要素が大きくなります。
      </p>
      <h3 class="title">
        <a id="chapter3-15"></a>
        3-15. スクエア1
      </h3>
      <p>
        スクエア1は、公式競技の中で唯一変形型のパズルで、動かすと形が四角から別の形へ変わっていきます。
        見た目の説明をするのはとても難しいので、下記ページを参考にして下さい。<br />
        <a href="https://store.tribox.com/products/detail.php?product_id=2815"  target="_blank">
          https://store.tribox.com/products/detail.php?product_id=2815
        </a>
      </p>
      <p>
        立方体のように見えて、実は高さが少しだけ高い直方体です
        （その理由について考えてみると面白いかもしれません）。
        さまざまな形に変形し、また回転の制約も強いため、バラバラにするだけでも結構大変です
      </p>
      <p>
        スクエア1を解くにおいて、ルービックキューブを解く知識はほとんど使えないため、
        スクエア1のための解き方や手順をしっかりと習得する必要があります。
      </p>

      <h3 class="title">
        <a id="short4"></a>
        小話4 視覚障がい者とルービックキューブ
      </h3>
      <p>
        ルービックキューブは、実は全盲の視覚がい者の方も楽しむことができるパズルです。
        「色を揃える」ことを目的とするルービックキューブは、
        普通に考えると見ることができないことには遊ぶことが不可能なように思えます。
        確かに普通のルービックキューブでは色が揃っているのか揃っていないのか分からないので、
        遊ぶことはできません。ではどうするかというと、各面にそれぞれ手触りの違いをつけることで、
        ルービックキューブが揃っていることを表現します。
        それは例えば点字で表してもいいですし、
        もっと分かりやすいように面によってそれぞれ別の形にビーズを装飾することで面の違いを表現することもできます。
      </p>
      <p>
        WCAの公式ルールの中でも、「視覚障がいを持つ競技者は異なる面に異なる手触りがあるパズルを用いることができる」
        という明確なルールがあります。ただし、視覚障がい者にとっては色は関係なくても、
        スクランブラやジャッジが判断できるよう各面は異なる色がついていることが望ましいともされています。
        日本でも、実際に全盲で公式大会に出場されている方がいらっしゃいます。
      </p>
      <p>
        また、全盲ではないまでも、世界のトップレベルの選手の中にも色盲により色の区別が付きにくいという競技者もいます。
        こういった方は、自分が識別しやすいような色に自分のキューブをカスタマイズする等の工夫をしているようです。
      </p>
      <h3 class="title">
        <a id="chapter3-16"></a>
        3-16. 4x4x4 目隠し
      </h3>
      <p>
        4x4x4キューブを、目隠しをして揃える競技です。基本的なルールは、3x3x3目隠しと変わりません。
        Best of X（X=1～3）形式で順位を決めます。
        記憶量としては3x3x3キューブの約3倍になり、
        格段に難易度が上がるため3回連続で成功させることは容易ではありませんが、
        2019年から3x3x3目隠しと同様にMean of
        3によるランキング付けも開始されました。
      </p>
      <h3 class="title">
        <a id="chapter3-17"></a>
        3-17. 5x5x5 目隠し
      </h3>
      <p>
        5x5x5キューブを、目隠しをして揃える競技です。
        基本的なルールは、3x3x3目隠し、4x4x4目隠しと変わりません。 Best of
        X（X=1～3）形式で順位を決め、Mean of
        3によるランキング付けも2019年より開始されました。
        目隠し競技としては、公式競技の中で最大となります。記憶量は3x3x3キューブの約5倍になります。
      </p>
      <h3 class="title">
        <a id="chapter3-18"></a>
        3-18. 3x3x3 複数目隠し
      </h3>
      <p>
        3x3x3キューブを複数同時に記憶し、目隠しをして記憶したものをすべて揃える競技です。
        Best of X（X=1～3）形式で順位を決めます。
      </p>
      <p>
        挑戦するキューブの数によって制限時間が異なり、6個未満の場合はキューブの個数×10分（例：4個の場合40分）、
        6個以上の場合は一律して60分となります。世界記録は既に60個を超えているため、
        1つあたり1分以下で記憶と完成をこなしていることになります。
        過去には60分の上限がなく、5時間以上にも渡って競技を行っていたこともありますが、
        競技時間がかかりすぎるのと、記憶の要素が強すぎるとの理由で、60分の上限が決められました。
      </p>
      <p>
        完成されたパズルの個数から、未完成のパズルの個数を引いた結果から順位が決められます。
        つまり、10個挑戦して7個成功した場合は、7 - 3 = 4が結果となります。
        計算結果がゼロの場合（例：10個挑戦して5個成功）までは記録が認められますが、
        マイナスとなった場合（例：10個挑戦して4個成功）は記録なしとなります。
        ただし例外として、2個挑戦して1個成功した場合は記録なしとなります。
        結果個数が同じ競技者がいる場合は、よりタイムの早い人が順位が上になります。
      </p>
      <p>
        何十個ものキューブを記憶する姿は見た目のインパクトが大きく、
        テレビ等でもとりあげられることが多い競技です。
        5x5x5目隠し以上に、キューブの技術よりも記憶の技術に重点が置かれた競技になります。
      </p>
    </section>
    <section class="section">
      <h2 class="title">
        <a id="summary"></a>
        まとめ
      </h2>
      <p>
        ルービックキューブの公式大会について、そして公式競技として認定されている全17種目について、紹介しました。
      </p>
      <p>
        ルービックキューブは、ただでさえ完成させるのが難しく、
        スピードキューブを競技として行うには最初のハードルが非常に高いものだと思います。
        しかし、決して特殊な才能を持っている人たちがやっているものではなく、
        どんなトップ選手であっても、最初は解き方を調べたり教えてもらったりして、
        そして早く解くための解法を学び、練習を重ねています。
      </p>
      <p>
        私はスピードキューブについて説明するときに、「ジャグリングやけん玉に近い」という表現をよく使います。
        ジャグリングであれば、練習を積み重ね、少しずつできることが増えていき、
        より難しい技ができるといった過程が想像しやすいのではないかと思います。
        スピードキューブもそれと同じで、練習を重ねることで少しずつ技術が向上していき、タイムを縮めることができます。
        ジャグリングとスピードキューブの違うところは、
        より早くそろえるために「手順の記憶」が必要だということかと思います。
      </p>
      <p>
        また、スピードキューブの技術向上には情報収集もとても重要です。
        スピードキューブはまだまだ発展途上の競技であり、手順も技術も、日々新しいものが開発、議論されています。
        世界中で行われているものですので英語による情報が多いですが、日本でもインターネット上やオフ会、定例会等で、
        たくさんの議論が行われています。こういった人たちとの交流や情報交換というのが、
        今では欠かせないものになっています。
      </p>
      <p>
        スピードキューブをしていてある程度の早さで揃えられる方と話をすると、
        「大会出場はもう少し早くなってから」とおっしゃる方が多くいます。
        そういう方には、私は「今すぐにでも大会にでましょう」と必ずいいます。
        たとえ今納得できない記録であっても、大会にでることは自身のモチベーションにもつながりますし、
        世界トップレベルの選手の試技を見たり、直接話を聞くことだってできます。
        これからもっと早くなりたいと思うのであれば、全く躊躇する必要はありません。
      </p>
      <p>
        本書が、少しでもこれから大会に参加しようという方たちの後押しになればと思います。
      </p>
    </section>
  </div>
</template>

<style scoped>
p {
  text-indent: 1rem;
  line-height: 1.7;
  color: #dcdcdc;
}
a {
  padding-top: 80px;
  margin-top: -80px;
  color: #e6e6fa !important;
}
h2 {
  margin-top: 2rem;
  margin-bottom: 1rem;
}
h3 {
  margin-top: 1rem;
  margin-bottom: 1rem;
}
h4 {
  margin-top: 1rem;
  margin-bottom: 0.5rem;
}
</style>
